{
  "Levels": [
    {
      "LevelID": 1,
      "Dialogues": {
        "OnHelpButton": [
          {
            "ID": "where_to_find_numbers",
            "ButtonText": "Where to find numbers?",
            "UserQuestion": "Where should I find the numbers in this puzzle?",
            "BotReply": "Look around the glowing blocks in the environment. They usually contain the numbers you need for solving the puzzle."
          },
          {
            "ID": "how_to_pickup",
            "ButtonText": "How to pick up?",
            "UserQuestion": "How do I pick up objects in the game?",
            "BotReply": "To pick up an object, move close to it and press the 'Pick Up' button at the bottom right corner of your screen."
          },
          {
            "ID": "stuck_on_step",
            "ButtonText": "I’m stuck on Step 1",
            "UserQuestion": "I am stuck on Step 1 of this puzzle. What should I do?",
            "BotReply": "For Step 1, try finding the two blocks with the same number. That’s your starting clue."
          },
          {
            "ID": "need_hint",
            "ButtonText": "Need a hint",
            "UserQuestion": "Can I get a hint for solving this puzzle?",
            "BotReply": "Sure! Focus on matching the smallest number block with its correct position first. That will make the puzzle easier."
          },
          {
            "ID": "explain_math",
            "ButtonText": "Explain the math",
            "UserQuestion": "Can you explain the math behind this puzzle?",
            "BotReply": "This puzzle is based on addition. You need to combine the numbers from different blocks so their total equals the target shown at the top."
          }
        ],
        "OnWrongAttempt": [
          "Hmm, not quite. Maybe try combining the blocks differently?",
          "Think again — could that operator be useful here?"
        ],
        "OnRightAttempt": [
          "Nice move! You chose the correct step.",
          "Yes! That block was the right choice.",
        ],
        "OnEquationProgress": [
          "That looks promising, keep going!",
          "Keep pushing — it’s coming together!"
        ],
        "OnLevelComplete": [
          "Great job! You cracked the level.",
          "Perfect! On to the next challenge."
        ]
      }
    },
    {
      "LevelID": 2,
      "Dialogues": {
        "OnHelpButton": [
          {
            "ID": "operators_help",
            "ButtonText": "Which operator to use?",
            "UserQuestion": "I’m confused about which operator to use in this puzzle.",
            "BotReply": "Check the target number. If it’s bigger than the numbers available, try using addition or multiplication."
          },
          {
            "ID": "wrong_attempts",
            "ButtonText": "Why am I wrong?",
            "UserQuestion": "Why do I keep getting the equation wrong?",
            "BotReply": "Make sure you are following the correct order of operations (PEMDAS). Parentheses first!"
          },
          {
            "ID": "need_example",
            "ButtonText": "Show me an example",
            "UserQuestion": "Can you show me an example of how to solve this?",
            "BotReply": "For example: if the target is 12 and you have 3 and 4, you can use multiplication (3 × 4 = 12)."
          }
        ],
        "OnWrongAttempt": [
          "Close, but not quite. Try adjusting the order.",
          "Think: could this operator solve it?"
        ],
        "OnRightAttempt": [
          "Perfect! That’s the right move to continue.",
          "Awesome! You placed the right piece."
        ],
        "OnEquationProgress": [
          "Yes, you’re almost done!",
          "Nice! You’re getting closer."
        ],
        "OnLevelComplete": [
          "Excellent! Another level solved.",
          "Nice work! Ready for the next challenge?"
        ]
      }
    }
  ]
}
